package utils

import (
	"math/rand"
	"time"
)

func GenRandNickName() string {
	nickName := []string{"六道骸", "兽人加鲁鲁", "佐藤美和子", "观月光", "越前龙雅", "英雄王", "水轩", "艾奥里亚", "法儿",
		"石动乃绘", "卡嘉莉", "秋元小町", "西条七海", "云龙明", "蜥蜴王", "库莉希奴", "易岚岚", "茵蒂克丝", "相川摩季", "艾吉布雷苏",
		"可怜", "上条当麻", "沢田纲吉", "相泽佑一", "美神令子", "夏目", "式神天一", "八神太一", "启介", "海星使", "黑暗扎基",
		"蓝染惣右介", "桃乐丝", "露西艾拉", "古泉一树", "美铃", "鲇沢美咲", "艾林丝", "前原忍", "桂雏菊", "三无少女", "克蕾雅",
		"小卷子", "沙加", "路飞", "鸣人"}
	rand.Seed(time.Now().UnixNano())
	return nickName[rand.Intn(len(nickName))]
}
